uat_chat/Catalogs/ItobМестоположенияПоУмолчанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ItobМестоположенияПоУмолчанию</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Масштаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

uat_chat/Catalogs/ItobМестоположенияПоУмолчанию/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимость();
	
КонецПроцедуры // ПриОткрытии()

// Процедура - обработчик команды "ЗадатьМестоположение".
//
&НаКлиенте
Процедура ЗадатьМестоположение(Команда)
	
	Если НЕ ItobОперативныйМониторингКлиент.ПроверитьДоступностьСервисаCsmSvc(ItobОперативныйМониторинг.ПолучитьАдресСервисаCsmSvc()) Тогда
		Предупреждение("Сервис CsmSvc недоступен! Необходимо воспользоваться мастером настройки службы CsmSvc.");
		Возврат;
	
	КонецЕсли;
	
	ФормаОпределенияПоложения = ПолучитьФорму("Справочник.ItobМестоположенияПоУмолчанию.Форма.ФормаОпределенияПоложения");
		
	ФормаОпределенияПоложения.ВладелецФормы = ЭтаФорма;	
	ФормаОпределенияПоложения.Масштаб = Объект.Масштаб;
	ФормаОпределенияПоложения.Широта = Объект.Широта;
	ФормаОпределенияПоложения.Долгота = Объект.Долгота;
		
	РезультатФормы = ФормаОпределенияПоложения.ОткрытьМодально();
	
	Если РезультатФормы = Истина Тогда
		
		Объект.Масштаб = ФормаОпределенияПоложения.Масштаб;
		Объект.Широта  = ФормаОпределенияПоложения.Широта;
		Объект.Долгота = ФормаОпределенияПоложения.Долгота;
		
		ОбновитьВидимость();
				
	КонецЕсли;
	
	ФормаОпределенияПоложения = Неопределено;
	
КонецПроцедуры // ЗадатьМестоположение()

// Процедура обновляет надписи местоположения.
//
&НаКлиенте
Процедура ОбновитьВидимость()

	Элементы.НадписьМасштаб.Заголовок = "Первоначальный масштаб : "+Объект.Масштаб;
	Элементы.НадписьШирота.Заголовок  = "Широта центра карты  : "+Формат(Объект.Широта,"ЧЦ=10; ЧДЦ=5");
	Элементы.НадписьДолгота.Заголовок = "Долгота центра карты : "+Формат(Объект.Долгота,"ЧЦ=10; ЧДЦ=5");
	
КонецПроцедуры // ОбновитьВидимость()
